<script setup>
const isOpen = ref(false);
const isHomePage = ref(false);
const route = useRoute();

const open = () => {
  isOpen.value = !isOpen.value;
};

if (route.path === "/") {
  isHomePage.value = true;
}
</script>

<template>
  <section class="seo-section" :class="{ black: isHomePage }">
    <div class="container">
      <div class="div"></div>

      <div class="top" @click="open">
        <h2 class="title">Женские сумки</h2>

        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          :class="{ active: isOpen }"
          fill="black"
        >
          <path
            d="M12.0001 15.9536C11.8668 15.9536 11.7418 15.9328 11.6251 15.8911C11.5084 15.8495 11.4001 15.7786 11.3001 15.6786L6.70011 11.0786C6.51678 10.8953 6.42094 10.6661 6.41261 10.3911C6.40428 10.1161 6.50011 9.87863 6.70011 9.67863C6.88344 9.49529 7.11678 9.40362 7.40011 9.40362C7.68344 9.40362 7.91678 9.49529 8.10011 9.67863L12.0001 13.5536L15.9001 9.67863C16.0834 9.49529 16.3126 9.39946 16.5876 9.39112C16.8626 9.38279 17.1001 9.47863 17.3001 9.67863C17.4834 9.86196 17.5751 10.0953 17.5751 10.3786C17.5751 10.662 17.4834 10.8953 17.3001 11.0786L12.7001 15.6786C12.6001 15.7786 12.4918 15.8495 12.3751 15.8911C12.2584 15.9328 12.1334 15.9536 12.0001 15.9536Z"
          />
        </svg>
      </div>

      <div class="content" :class="{ active: isOpen }">
        <div class="content__inner">
          <p>
            Вашему вниманию представлен раздел "Женские сумки" нашего
            интернет-магазина Makey. Здесь собраны изделия, созданные для того,
            чтобы дополнить и усилить красоту каждой женщины. Наша коллекция
            включает в себя широкий спектр моделей, отвечающих самым
            разнообразным предпочтениям и потребностям.
            <br />
            <br />
            **Элегантность и практичность**: Каждая сумка в нашем ассортименте —
            это сочетание элегантности и практичности. Мы предлагаем
            классические сумки-тоты, удобные кросс-боди, стильные клатчи и
            многое другое. Все они выполнены из высококачественной кожи, которая
            со временем только приобретает больше шарма и изящества.
            <br />
            <br />
            **Разнообразие выбора**: Наши сумки доступны в различных цветах и
            стилях. От сдержанных и классических до смелых и экспрессивных — у
            нас есть сумка на любой вкус. Ищете что-то уникальное? Наши
            ограниченные серии и эксклюзивные модели ждут вас.
            <br />
            <br />
            **Качество, проверенное временем**: Мы гордимся тем, что наши сумки
            служат нашим клиенткам годами, сохраняя свой первоначальный вид и
            качество. Использование прочной фурнитуры и профессиональная
            обработка кожи гарантируют долговечность каждой сумки.
            <br />
            <br />
            **Для каждого случая жизни**: Независимо от того, идете ли вы на
            работу, вечеринку или просто выходите на прогулку, в нашем
            ассортименте найдется сумка, которая станет вашим идеальным
            спутником.
            <br />
            <br />
            **SEO-оптимизация для вашего успеха**: Мы позаботились о том, чтобы
            этот текст помог вашей странице лучше ранжироваться в поисковых
            системах, привлекая больше внимания к вашим изделиям.
            <br />
            <br />
            Приглашаем вас исследовать наш раздел "Женские сумки" и найти ту
            идеальную сумку, которая станет неотъемлемой частью вашего стиля. С
            Makey вы всегда будете на шаг впереди!
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style lang="scss" scoped>
.seo-section {
  margin-top: 200px;
  background: $bgWhite;

  &.black {
    background: $bgBlack;
    color: $textWhite;
    margin-top: 0;
    border-bottom: 1px solid rgba($bgWhite, 0.2);
    svg {
      fill: $bgWhite;
    }
  }
}
.div {
  width: 100%;
  height: 1px;
  background: rgba($bgBlack, 0.2);
}
.top {
  display: flex;
  align-items: center;
  justify-content: space-between;
  padding: 32px 0;
  cursor: pointer;

  svg {
    display: block;
    transition: all 0.3s ease-in-out;

    &.active {
      transform: rotate(180deg);
    }
  }
}

.title {
  font-size: 16px;
}

.content__inner {
  padding: 24px 0 40px;
}

.content {
  max-height: 0;
  overflow: hidden;
  transition: all 0.3s ease-in-out;
  color: $textGray;

  &.active {
    max-height: 1000px;
    height: auto;
  }
}
</style>
