export const seoData = {
  women: {
    title:
      "Женский каталог интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить изделия из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женский каталог ",
      content:
        "<h2>Каталог изделий Макей</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских изделий из натуральной кожи. В нашем каталоге вы найдете разнообразные изделия Макей, которые отличаются высоким качеством и стильным дизайном. Мы предлагаем изделия из кожи, которые станут идеальным дополнением к вашему образу. Если вы ищете изделия Макей каталог, наш магазин - это то, что вам нужно. У нас вы найдете изделия из кожи каталог с ценами, которые доступны для каждого. Также у нас можно купить изделия из кожи, которые прослужат вам долгие годы. В нашем ассортименте представлены изделия из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить изделия Макей каталог с ценами в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Изделия из кожи и аксессуары</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских изделий из кожи и аксессуаров. Мы предлагаем изделия из кожи, которые станут отличным дополнением к вашему стилю. У нас вы можете купить изделия из натуральной кожи, которые будут служить вам долгое время. Если вы хотите купить аксессуары из кожи, у нас есть множество вариантов на любой вкус. Наши изделия из кожи отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить изделия из кожи, которые станут отличным подарком для любой женщины.</p>",
    },
  },

  // Сумки
  "sumki-women": {
    title:
      "Женский каталог сумок интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить сумки из натуральной кожи для женщин. Различные типы сумок: кросс-боди, шопперы, тоуты, багеты. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские сумки",
      content:
        "<h2>Сумки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских сумок. У нас вы можете купить сумку женскую из натуральной кожи, которая станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные сумки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете женские сумки в Минске, наш магазин - это то, что вам нужно. У нас вы найдете сумку женскую купить Минск по доступной цене. Также у нас можно купить женскую сумку кожаную, которая прослужит вам долгие годы. В нашем ассортименте представлены сумки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить сумку женскую из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Кросс-боди, багеты, шопперы и тоуты</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских сумок различных типов. Мы предлагаем кросс-боди сумки, которые станут отличным дополнением к вашему стилю. У нас вы можете купить сумку багет, которая будет служить вам долгое время. Если вы хотите купить сумку шоппер, у нас есть множество вариантов на любой вкус. Наши сумки тоут отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить сумку, которая станет отличным подарком для любой женщины.</p>",
    },
  },

  // Ремни
  "remni-women": {
    title:
      "Женский каталог сумок интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить сумки из натуральной кожи для женщин. Различные типы сумок: кросс-боди, шопперы, тоуты, багеты. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские сумки",
      content:
        "<h2>Сумки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских сумок. У нас вы можете купить сумку женскую из натуральной кожи, которая станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные сумки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете женские сумки в Минске, наш магазин - это то, что вам нужно. У нас вы найдете сумку женскую купить Минск по доступной цене. Также у нас можно купить женскую сумку кожаную, которая прослужит вам долгие годы. В нашем ассортименте представлены сумки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить сумку женскую из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Кросс-боди, багеты, шопперы и тоуты</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских сумок различных типов. Мы предлагаем кросс-боди сумки, которые станут отличным дополнением к вашему стилю. У нас вы можете купить сумку багет, которая будет служить вам долгое время. Если вы хотите купить сумку шоппер, у нас есть множество вариантов на любой вкус. Наши сумки тоут отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить сумку, которая станет отличным подарком для любой женщины.</p>",
    },
  },

  // Рюкзаки
  "riukzaki-women": {
    title:
      "Женский каталог рюкзаков интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить рюкзаки из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские рюкзаки",
      content:
        "<h2>Рюкзаки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских рюкзаков. У нас вы можете купить рюкзак женский из натуральной кожи, который станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные рюкзаки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить рюкзак женский в Минске, наш магазин - это то, что вам нужно. У нас вы найдете рюкзак женский купить Минск по доступной цене. Также у нас можно купить кожаный рюкзак женский, который прослужит вам долгие годы. В нашем ассортименте представлены рюкзаки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить рюкзак женский из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Рюкзаки различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских рюкзаков различных типов. Мы предлагаем рюкзак женский, который станет отличным дополнением к вашему стилю. У нас вы можете купить женский рюкзак, который будет служить вам долгое время. Если вы хотите купить женский кожаный рюкзак, у нас есть множество вариантов на любой вкус. Наши рюкзаки отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить рюкзак женский Макей, который станет отличным подарком для любой женщины. </p>",
    },
  },

  // Ежедневники
  "ezednevniki-women": {
    title:
      "Женский каталог ежедневников интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить ежедневники из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские ежедневники",
      content:
        "<h2>Ежедневники из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских ежедневников. У нас вы можете купить женский ежедневник из натуральной кожи, который станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные ежедневники женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить женский ежедневник в Минске, наш магазин - это то, что вам нужно. У нас вы найдете ежедневник женский купить Минск по доступной цене. Также у нас можно купить кожаный ежедневник женский, который прослужит вам долгие годы. В нашем ассортименте представлены ежедневники женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить ежедневник женский из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Ежедневники различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских ежедневников различных типов. Мы предлагаем ежедневник женский, который станет отличным дополнением к вашему стилю. У нас вы можете купить женский ежедневник, который будет служить вам долгое время. Если вы хотите купить женский кожаный ежедневник, у нас есть множество вариантов на любой вкус. Наши ежедневники отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить ежедневник женский Макей, который станет отличным подарком для любой женщины. </p>",
    },
  },

  // Кошельки
  "koselki-women": {
    title:
      "Женский каталог кошельков интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить кошельки, портмоне, зажимы для денег из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские кошельки",
      content:
        "<h2>Кошельки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских кошельков. У нас вы можете купить кошелек женский из натуральной кожи, который станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные кошельки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить кошелек женский в Минске, наш магазин - это то, что вам нужно. У нас вы найдете кошелек женский купить Минск по доступной цене. Также у нас можно купить кожаный кошелек женский, который прослужит вам долгие годы. В нашем ассортименте представлены кошельки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить кошелек женский из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Портмоне и кошельки различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских кошельков различных типов. Мы предлагаем портмоне женское, которое станет отличным дополнением к вашему стилю. У нас вы можете купить женское портмоне, которое будет служить вам долгое время. Если вы хотите купить женское кожаное портмоне, у нас есть множество вариантов на любой вкус. Наши кошельки отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить кошелек женский Макей, который станет отличным подарком для любой женщины. </p>",
    },
  },

  // Косметички
  "kosmeticki-women": {
    title:
      "Женский каталог косметичек интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить косметички из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские косметички",
      content:
        "<h2>Косметички из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских косметичек. У нас вы можете купить женскую косметичку из натуральной кожи, которая станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные косметички женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить косметичку женскую в Минске, наш магазин - это то, что вам нужно. У нас вы найдете косметичку женскую купить Минск по доступной цене. Также у нас можно купить кожаную косметичку женскую, которая прослужит вам долгие годы. В нашем ассортименте представлены косметички женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить косметичку женскую из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Косметички различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских косметичек различных типов. Мы предлагаем косметичку женскую, которая станет отличным дополнением к вашему стилю. У нас вы можете купить женскую косметичку, которая будет служить вам долгое время. Если вы хотите купить женскую кожаную косметичку, у нас есть множество вариантов на любой вкус. Наши косметички отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить косметичку женскую Макей, которая станет отличным подарком для любой женщины. </p>",
    },
  },

  // Обложки
  "oblozhki-women": {
    title:
      "Женский каталог обложек интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить косметички из натуральной кожи для женщин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Женские обложки",
      content:
        "<h2>Обложки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских обложек для паспорта и автодокументов. У нас вы можете купить женскую обложку из натуральной кожи, которая станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные обложки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить обложку женскую в Минске, наш магазин - это то, что вам нужно. У нас вы найдете обложку женскую купить Минск по доступной цене. Также у нас можно купить кожаную обложку женскую, которая прослужит вам долгие годы. В нашем ассортименте представлены обложки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить обложку женскую из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Обложки различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских обложек различных типов. Мы предлагаем обложку женскую, которая станет отличным дополнением к вашему стилю. У нас вы можете купить женскую обложку, которая будет служить вам долгое время. Если вы хотите купить женскую кожаную обложку, у нас есть множество вариантов на любой вкус. Наши обложки отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить обложку женскую Макей, которая станет отличным подарком для любой женщины. </p>",
    },
  },

  //   Мужский каталог
  men: {
    title:
      "Мужской каталог интернет-магазина. Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить изделия из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужской каталог ",
      content:
        "<p>Ищете идеальный подарок для мужчины? Тогда вы попали по адресу! В интернет-магазине Макей представлен широкий ассортимент кожаных изделий, которые станут прекрасным подарком для любого мужчины.</p><p>Если вы ищете стильный аксессуар, то мы предлагаем вам широкий выбор ремней. У нас есть ремни из натуральной кожи, которые подчеркнут индивидуальность вашего мужчины.</p><p>Для активных людей у нас есть рюкзаки. Они удобны и вместительны, поэтому ваш мужчина сможет взять с собой всё необходимое.</p><p>Также у нас вы можете приобрести ежедневник, который поможет вашему мужчине организовать свой день. Мы предлагаем ежедневники разных форматов и цветов.</p><p>Кошельки и портмоне также представлены в нашем ассортименте. Они изготовлены из качественной кожи и имеют привлекательный дизайн. Вы можете выбрать классический вариант или что-то более оригинальное.</p><p>Обложки для документов также пользуются популярностью среди наших клиентов. Они защищают документы от повреждений и придают им солидный вид.</p><p>Не упустите возможность приобрести качественные кожаные изделия по доступным ценам! Посетите наш интернет-магазин и выберите то, что понравится вашему мужчине.</p><p>Мы уверены, что он останется доволен вашим выбором!</p>",
    },
  },
  // Сумки
  "sumki-men": {
    title:
      "Мужской каталог сумок интернет-магазина Макей! Купить мужскую сумку из натуральной кожи! ",
    description:
      "Купить мужскую сумку из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские сумки",
      content:
        "<p>Ищете идеальную мужскую сумку? Тогда вы попали по адресу! В интернет-магазине «Макей» представлен широкий ассортимент мужских сумок, которые станут прекрасным дополнением к вашему образу.</p><p>В нашем каталоге вы найдете сумки разных стилей и размеров. Мы предлагаем классические модели, сумки через плечо, дорожные сумки и даже сумки на пояс. Все изделия изготовлены из высококачественной кожи и имеют привлекательный дизайн.</p><p>Если вы ищете стильную и практичную сумку, то мы предлагаем вам широкий выбор моделей через плечо. Они удобны и вместительны, поэтому вы сможете взять с собой все необходимое.</p><p>Для активных людей у нас есть дорожные сумки. Они изготовлены из прочной кожи, которая не боится влаги и грязи. Вы можете выбрать сумку для путешествий или для занятий спортом. </p><p>Также у нас вы можете приобрести сумку на пояс. Она удобна для ношения документов, денег и других мелочей. Сумка на пояс станет отличным выбором для тех, кто ценит свободу движений.</p><p>Не упустите возможность приобрести качественную мужскую сумку по доступной цене! Посетите наш интернет-магазин и выберите то, что вам нравится.</p><p>Мы уверены, что вы останетесь довольны покупкой!</p>",
    },
  },

  // Ежедневники
  "ezednevniki-men": {
    title: "Мужской каталог ежедневников интернет-магазина Макей!",
    description:
      "Купить ежедневник из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские ежедневники",
      content:
        "<h2>Ежедневники из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент мужских рюкзаков. У нас вы можете купить мужской рюкзак из натуральной кожи, который станет идеальным аксессуаром для любого мужчины. Мы предлагаем кожаные Ежедневники мужские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете мужские Ежедневники в Минске, наш магазин - это то, что вам нужно. У нас вы найдете рюкзак мужской купить Минск по доступной цене. Также у нас можно купить мужской рюкзак кожаный, который прослужит вам долгие годы. В нашем ассортименте представлены Ежедневники мужские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить рюкзак мужской из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Городские Ежедневники</h2> <p> В интернет-магазине Макей вы найдете широкий выбор мужских городских рюкзаков. Мы предлагаем городской рюкзак мужской из кожи, который станет отличным дополнением к вашему стилю. У нас вы можете купить рюкзак мужской из натуральной кожи, который будет служить вам долгое время. Если вы хотите купить рюкзак в Гомеле, у нас есть множество вариантов на любой вкус. Наши Ежедневники мужские отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить рюкзак, который станет отличным подарком для любого мужчины</p>",
    },
  },

  // Рюкзаки
  "riukzaki-men": {
    title:
      "Мужской каталог рюкзаков интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить рюкзаки из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские рюкзаки",
      content:
        "<h2>Рюкзаки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент женских рюкзаков. У нас вы можете купить рюкзак мужской из натуральной кожи, который станет идеальным аксессуаром для любой женщины. Мы предлагаем кожаные рюкзаки женские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете купить рюкзак мужской в Минске, наш магазин - это то, что вам нужно. У нас вы найдете рюкзак мужской купить Минск по доступной цене. Также у нас можно купить кожаный рюкзак мужской, который прослужит вам долгие годы. В нашем ассортименте представлены рюкзаки женские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить рюкзак мужской из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Рюкзаки различных типов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор женских рюкзаков различных типов. Мы предлагаем рюкзак мужской, который станет отличным дополнением к вашему стилю. У нас вы можете купить мужской рюкзак, который будет служить вам долгое время. Если вы хотите купить мужской кожаный рюкзак, у нас есть множество вариантов на любой вкус. Наши рюкзаки отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить рюкзак мужской Макей, который станет отличным подарком для любой женщины. </p>",
    },
  },

  // Кошельки
  "koselki-men": {
    title:
      "Мужской каталог кошельков интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить кошельки, портмоне, зажимы для денег из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские кошельки, портмоне, зажимы для денег",
      content:
        "<h2>Кошельки из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент мужских кошельков. У нас вы можете купить кошелек мужской из натуральной кожи, который станет идеальным аксессуаром для любого мужчины. Мы предлагаем кожаные кошельки мужские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете мужские кошельки в Минске, наш магазин - это то, что вам нужно. У нас вы найдете кошелек мужской купить Минск по доступной цене. Также у нас можно купить мужской кошелек кожаный, который прослужит вам долгие годы. В нашем ассортименте представлены кошельки мужские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить кошелек мужской из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Портмоне и зажимы для денег</h2> <p> В интернет-магазине Макей вы найдете широкий выбор мужских портмоне и зажимов для денег. Мы предлагаем портмоне мужское из кожи, которое станет отличным дополнением к вашему стилю. У нас вы можете купить портмоне мужское из натуральной кожи, которое будет служить вам долгое время. Если вы хотите купить зажим для денег, у нас есть множество вариантов на любой вкус. Наши зажимы для денег мужские отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить зажим для денег, который станет отличным подарком для любого мужчины. </p>",
    },
  },

  // Косметички
  "kosmeticki-men": {
    title:
      "Мужской каталог косметичек интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить косметички из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские косметички",
      content:
        "<h2>Косметички из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент мужских косметичек. У нас вы можете купить мужскую косметичку из натуральной кожи, которая станет идеальным аксессуаром для любого мужчины. Мы предлагаем кожаные косметички мужские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете мужские косметички в Минске, наш магазин - это то, что вам нужно. У нас вы найдете косметичку мужскую купить Минск по доступной цене. Также у нас можно купить мужскую косметичку кожаную, которая прослужит вам долгие годы. В нашем ассортименте представлены косметички мужские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить косметичку мужскую из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Косметички для путешествий и повседневного использования</h2> <p> В интернет-магазине Макей вы найдете широкий выбор мужских косметичек для путешествий и повседневного использования. Мы предлагаем косметичку мужскую из кожи, которая станет отличным дополнением к вашему стилю. У нас вы можете купить косметичку мужскую из натуральной кожи, которая будет служить вам долгое время. Если вы хотите купить косметичку для путешествий, у нас есть множество вариантов на любой вкус. Наши косметички мужские отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить косметичку, которая станет отличным подарком для любого мужчины. </p>",
    },
  },

  // Обложки
  "oblozhki-men": {
    title:
      "Мужской каталог обложек интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купить косметички из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские обложки для документов",
      content:
        "<h2>Обложки для паспорта и автодокументов</h2> <p>Интернет-магазин Макей предлагает широкий ассортимент обложек для документов из натуральной кожи. У нас вы можете купить обложку для паспорта или автодокументов, которая станет идеальным аксессуаром для любого мужчины. Мы предлагаем кожаные обложки, которые отличаются высоким качеством и стильным дизайном. Если вы ищете обложки для документов в Минске, наш магазин - это то, что вам нужно. У нас вы найдете обложку для документов купить Минск по доступной цене. Также у нас можно купить кожаную обложку для документов, которая прослужит вам долгие годы. В нашем ассортименте представлены обложки для документов из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить обложку для документов из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси.</p> <h2>Обложки для автодокументов</h2> <p>В интернет-магазине Макей вы найдете широкий выбор обложек для автодокументов. Мы предлагаем обложку для автодокументов из кожи, которая станет отличным дополнением к вашему стилю. У нас вы можете купить обложку для автодокументов из натуральной кожи, которая будет служить вам долгое время. Если вы хотите купить обложку для автодокументов, у нас есть множество вариантов на любой вкус. Наши обложки для автодокументов отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить обложку для автодокументов, которая станет отличным подарком для любого мужчины.</p> ",
    },
  },

  // Ремни
  "remni-men": {
    title: "Мужской каталог ремней интернет-магазина Макей!",
    description:
      "Купить ремень из натуральной кожи для мужчин. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Мужские ремни",
      content:
        "<h2>Ремни из натуральной кожи</h2> <p> Интернет-магазин Макей предлагает широкий ассортимент мужских ремней. У нас вы можете купить мужской ремень из натуральной кожи, который станет идеальным аксессуаром для любого мужчины. Мы предлагаем кожаные ремни мужские, которые отличаются высоким качеством и стильным дизайном. Если вы ищете мужские ремни в Минске, наш магазин - это то, что вам нужно. У нас вы найдете ремень мужской купить Минск по доступной цене. Также у нас можно купить мужской ремень кожаный, который прослужит вам долгие годы. В нашем ассортименте представлены ремни мужские из натуральной кожи, которые идеально подойдут для подарка. Вы можете купить ремень мужской из натуральной кожи в нашем интернет-магазине с доставкой по всей Беларуси. </p> <h2>Брючные ремни и ремни для джинсов</h2> <p> В интернет-магазине Макей вы найдете широкий выбор мужских брючных ремней и ремней для джинсов. Мы предлагаем брючный ремень мужской из кожи, который станет отличным дополнением к вашему стилю. У нас вы можете купить ремень мужской из натуральной кожи, который будет служить вам долгое время. Если вы хотите купить ремень для джинсов, у нас есть множество вариантов на любой вкус. Наши ремни для джинсов мужские отличаются высоким качеством и стильным дизайном. В нашем магазине вы можете купить ремень для джинсов, который станет отличным подарком для любого мужчины. </p>",
    },
  },
  // Подарки
  gifts: {
    title:
      "Каталог подарков интернет-магазина Макей! Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
    description:
      "Купите подарок Вашим близким от бренда Макей! Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Подарки",
      content:
        "<p> Откройте для себя изысканную коллекцию подарков из натуральной кожи от компании Макей. Наши изделия сочетают в себе высокое качество, стиль и функциональность, что делает их идеальным выбором для любого случая. </p> <h2>Сумки и рюкзаки</h2> <p> Наши кожаные сумки и рюкзаки ручной работы – это воплощение элегантности и практичности. Они идеально подходят как для деловых встреч, так и для повседневного использования. Каждое изделие создано с вниманием к деталям и заботой о комфорте. </p> <h2>Ремни</h2> <p>Кожаные ремни от Макей – это не просто аксессуар, а важная деталь вашего образа. Они отличаются прочностью и стильным дизайном, который подчеркнет вашу индивидуальность.</p> <h2>Кошельки и портмоне</h2> <p>Наши кошельки и портмоне из натуральной кожи – это сочетание удобства и элегантности. Они помогут вам организовать ваши финансы и станут стильным дополнением к вашему образу.</p> <h2>Зажимы для денег</h2> <p>Кожаные зажимы для денег от Макей – это идеальный выбор для тех, кто ценит минимализм и функциональность. Они компактны, удобны и надежны.</p>",
    },
  },

  // Новинки
  new: {
    title:
      "Новые коллекции от компании Макей! Не упустите шанс приобрести товары из лимитированных коллекций",
    description:
      "Представляем новые коллекции от компании Макей! Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Новинки",
      content:
        "<p> Откройте для себя новейшие коллекции кожаных изделий от компании Макей, где каждая деталь воплощает мастерство и стиль. Наши новые модели созданы для тех, кто ценит качество, элегантность и функциональность. </p> <h2>Сумки и рюкзаки</h2> <p> Наши новые кожаные сумки и рюкзаки – это идеальное сочетание моды и удобства. Они подходят как для деловых встреч, так и для повседневного использования, предлагая вам стильные решения для любого случая. </p> <h2>Ремни</h2> <p> Новая коллекция кожаных ремней от Макей – это воплощение изысканности и прочности. Эти ремни станут важной деталью вашего образа, подчеркивая вашу индивидуальность и вкус. </p> <h2>Кошельки и портмоне</h2> <p> Наши новые кошельки и портмоне из натуральной кожи – это идеальное сочетание функциональности и стиля. Они помогут вам организовать ваши финансы и станут стильным дополнением к вашему образу. </p> <h2>Зажимы для денег</h2> <p> Кожаные зажимы для денег из новой коллекции Макей – это выбор для тех, кто ценит минимализм и удобство. Они компактны, надежны и элегантны, идеально подходя для современного ритма жизни. </p>",
    },
  },
  sale: {
    title: "Скидки от компании Макей! Доступность товаров из натуральной кожи",
    description:
      "Приобретайте товары на скидках от бренда Макей! Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
    text: {
      title: "Скидки",
      content:
        "<p> Не упустите возможность приобрести высококачественные изделия из натуральной кожи от компании Макей по сниженным ценам! Воспользуйтесь нашими специальными предложениями и порадуйте себя и своих близких стильными и долговечными аксессуарами. </p> <h2>Сумки и рюкзаки</h2> <p> Наши кожаные сумки и рюкзаки ручной работы теперь доступны по выгодным ценам. Они сочетают в себе элегантность и практичность, идеально подходя как для деловых встреч, так и для повседневного использования. Каждое изделие создано с вниманием к деталям и заботой о комфорте. </p> <h2>Ремни</h2> <p> Кожаные ремни от Макей – это не просто аксессуар, а важная деталь вашего образа. Воспользуйтесь скидками и подчеркните свою индивидуальность стильным и прочным ремнем. </p> <h2>Кошельки и портмоне</h2> <p> Наши кошельки и портмоне из натуральной кожи – это сочетание удобства и элегантности. Теперь вы можете организовать свои финансы и дополнить свой образ стильным аксессуаром по сниженной цене. </p> <h2>Зажимы для денег</h2> <p> Кожаные зажимы для денег от Макей – это идеальный выбор для тех, кто ценит минимализм и функциональность. Они компактны, удобны и надежны, а сейчас доступны по специальным ценам. </p>",
    },
  },
};
