<script setup>
import Accordition from "~/components/ui/Accordition.vue";

const payData = [
  {
    id: 1,
    title: "1. Банковской картой онлайн",
    text: "Да, цены актуальные, иначе и быть не может. Если вы находитесь на территории Беларуси, то видите цены в белорусских рублях. Находясь на территории России – в российских рублях. За пределами Беларуси и России цены будут не доступны.",
  },
  {
    id: 2,
    title: "2. Приложение «Оплати»",
    text: "Да, цены актуальные, иначе и быть не может. Если вы находитесь на территории Беларуси, то видите цены в белорусских рублях. Находясь на территории России – в российских рублях. За пределами Беларуси и России цены будут не доступны.",
  },
  {
    id: 3,
    title: "3. Карты рассрочки",
    text: "Да, цены актуальные, иначе и быть не может. Если вы находитесь на территории Беларуси, то видите цены в белорусских рублях. Находясь на территории России – в российских рублях. За пределами Беларуси и России цены будут не доступны.",
  },
  {
    id: 4,
    title: "4. Apple Pay",
    text: "Да, цены актуальные, иначе и быть не может. Если вы находитесь на территории Беларуси, то видите цены в белорусских рублях. Находясь на территории России – в российских рублях. За пределами Беларуси и России цены будут не доступны.",
  },
  {
    id: 5,
    title: "5. Webpay",
    text: "<p>Безопасный сервер WEBPAY устанавливает шифрованное соединение по защищенному протоколу TLS и конфиденциально принимает от клиента данные его платёжной карты (номер карты, имя держателя, дату окончания действия, и контрольный номер банковской карточке CVC/CVC2).</p> <br/> <p> После совершения оплаты с использованием банковской карты необходимо сохранять полученные карт-чеки (подтверждения об оплате) для сверки с выпиской из карт-счёта (с целью подтверждения совершённых операций в случае возникновения спорных ситуаций)..</p> <br/> В случае, если Вы не получили заказ (не оказана услуга), Вам необходимо обратиться (в службу технической поддержки) по телефону +375 (33) 301-70-17 или e-mail makeyecom@yandex.by . Менеджеры Вас проконсультируют. При оплате банковской платежной картой возврат денежных средств осуществляется на карточку, с которой была произведена оплата",
  },

  {
    id: 6,
    title: "6. Оплата через ЕРИП",
    text: '<ol><li>1.Пункт "Система"Расчет" (ЕРИП).</li><li>2.Интернет магазины/сервисы.</li><li>3.В списке выбираем букву «М».</li><li>4.<a href="https://4.Makey.by">Makey.by.</a></li><li>5.Для оплаты "Товара" ввести номер заказа.</li><li>6.Проверить корректность информации.</li><li>7.Совершить платеж.</li></ol><br><p>Благодарим Вас за оплату!</p><p>Компания "Макей"!</p>',
  },
];
</script>

<template>
  <main>
    <section class="top">
      <div class="container">
        <h2 class="title">Способы оплаты</h2>
      </div>
    </section>

    <section class="accordition">
      <div class="container">
        <div class="accordition-wrap">
          <Accordition v-for="item in payData" :data="item" />
        </div>

        <div class="div"></div>

        <h2 class="title">Способы доставки</h2>

        <div class="accordition-wrap">
          <Accordion v-for="item in payData" :data="item" />
        </div>
      </div>
    </section>

    <Spacer />
  </main>
</template>

<style scoped lang="scss">
.top {
  margin-top: 100px;
}

.title {
  font-size: 24px;
  line-height: 29px;
  font-weight: 600;
}

.accordition {
  margin-top: 32px;
}

.div {
  height: 1px;
  margin: 64px 8px;
  background: rgba(#000, 0.3);
}

.accordition-wrap {
  margin-top: 32px;
  display: flex;
  flex-direction: column;
  gap: 16px;
}
</style>
