<script setup>
useSeoMeta({
  title:
    "Официальный интернет-магазин Макей - кожаные сумки, кошельки и аксессуары ручной работы!",
  description:
    "Интернет-магазин компании Макей. Лучшие кожаные изделия от бренда Макей. Кожаные изделия ручной работы. Доставка по  Минску! Гарантия на изделия!",
});
</script>

<template>
  <main>
    <SectionsIndexHero />
    <WidgetsSeoText
      title="Интернет-магазин"
      text="<h2>Добро пожаловать в интернет-магазин Макей! Мы предлагаем широкий ассортимент кожаных изделий, которые станут прекрасным дополнением к вашему образу. В нашем каталоге вы найдёте сумки, ремни, рюкзаки, ежедневники, кошельки и обложки для документов.</h2>

<p>В нашем интернет-магазине вы можете купить сумку, которая станет вашим верным спутником в любых путешествиях. У нас есть сумки разных размеров, цветов и стилей. Вы можете выбрать классическую модель или что-то более оригинальное.</p>

   <p>
      Если вы ищете стильный аксессуар, то мы предлагаем вам широкий выбор
      ремней. У нас есть ремни из натуральной кожи, которые подчеркнут вашу
      индивидуальность.
    </p>

    <p>
      Для активных людей у нас есть рюкзаки. Они удобны и вместительны, поэтому
      вы сможете взять с собой всё необходимое.
    </p>

    <p>
      Также у нас вы можете приобрести ежедневник, который поможет вам
      организовать свой день. Мы предлагаем ежедневники разных форматов и
      цветов. Кошельки и обложки для документов также представлены в нашем
      ассортименте.
    </p>
    <p>
      Они изготовлены из качественной кожи и имеют привлекательный дизайн. Не
      упустите возможность приобрести качественные кожаные изделия по доступным
      ценам! Посетите наш интернет-магазин и выберите то, что вам нравится. Мы
      уверены, что вы останетесь довольны покупкой!
    </p>

"
    />
  </main>
</template>

<style lang="scss" scoped>
.section {
  height: 100vh;
  background: #000;
}
</style>
